---
layout: single
title: "1일1로그(41~42)"
categories: coding
tag: [python, jekyll, blog]
toc: true
author_profile: false
sidebar:
  nav: "docs"
# search: false
---

# 41. 자바스크립트와 파이썬 42. 프로그래밍 언어의 주요 개념

## 💙 자바스크립트

자바스크립트 : 객체 기반의 스크립트 프로그래밍 언어, Ecma International의 프로토타입 기반의 프로그래밍 언어, HTML, CSS 와 함께 웹을 구성하는 요소 중 하나

HTML이 웹 페이지의 기본 구조를 담당하고, CSS가 디자인을 담당한다면 JavaScript는 클라이언트 단에서 웹 페이지가 동작하는 것을 담당합니다.

자바스크립트는 웹 브라우저 내에서 주로 사용되며, 다른 응용 프로그램의 내장 객체에도 접근할 수 있는 기능을 가지고 있습니다. 또한 Node.js 와 같은 런타임 환경과 같이 서버 프로그래밍에도 사용되고 있습니다. 모든 브라우저에서 포함되어 있어 소프트웨어를 별도로 다운로드하지 않아도 되고,

언어 자체가 간단하며, 유연합니다. 그렇기에 초보자 수준에서 배우기 쉽고, 더 큰 프로그램으로 확장

하기에도 용이하며, 폭넓게 적용 가능합니다.

자바스크립트는 트위터, 페이스북, 아마존 등의 웹 서비스에서 제공하는 API를 위한 언어이기도 합니다.

자바스크립트의 단점으로는 의도와 다른 동작을 일으킬 때도 있으며, 브라우저 인터페이스는 우리가 원하는 만큼 표준화 되어 있지 않아서 프로그램이 서로 다른 브라우저에서 항상 같은 방식으로 작동하지는 않습니다.

## 💛 파이썬

파이썬 : 인터프리터 방식의 프로그래밍 언어

파이썬 프로그램을 실행 시키면, 인터프리터(interpreter)가 코드를 실행하면서 타입(type)을 추론하여 체크합니다. 고정되어 있지 않기 때문에, 원하는 대로 변경이 가능하죠. 명시적인 타입 정의가 필요 없습니다.

파이썬은 문법이 매우 쉬워서 작성하기에 간단하기 때문에 초보자들이 처음 프로그래밍을 배울 때 추천되는 언어입니다. 매우 폭넓은 응용 분야에 활용 가능하며 일상적으로 프로그래밍하기에 아주 좋습니다. 요즘에는 파이썬 프로그램을 웹에서 실행할 수 있게 해주는 웹사이트가 있어서 별도의 소프트웨어를 다운로드하거나 명령줄 인터페이스 사용법을 배울 필요가 없습니다. 머신러닝, 딥러닝,

AI 등 빅데이터 관련 데이터 분석 및 모델링 작업이 가능합니다. 활용도가 무궁무진합니다.

전에는 파이썬 버전2를 사용했었지만, 파이썬 버전3이 나온 후로 버전3으로 사용합니다.

파이썬 최신 버전일 수록 더 빠른 런타임을 제공하며, 초보자들이 더 쉽게 이해할 수 있게 나아지고 있습니다. 파이썬 2와 파이썬 3은 많은 차이점들이 있습니다. 간단하게 예를 들자면, 파이썬 2에서 소수점 이하 자릿수 없이 숫자를 쓰면 계산이 가장 가까운 정수로 반올림 됩니다. 파이썬 3에서는 소수점 자리까지 결과가 나옵니다. print()문법 차이도 있습니다.

[https://pythonfundu.blogspot.com/2019/02/python-2-vs-3.html](https://pythonfundu.blogspot.com/2019/02/python-2-vs-3.html)

프로그래밍 언어는 모두 계산을 일련의 단계로 풀어서 상세히 설명하기 위한 표기법입니다.

모든 프로그래밍 언어가 입력 데이터를 읽고, 산술 연산을 하고, 계산이 진행됨에 따라 중간 값을 저장하고 가져오며, 이전에 계산한 값을 기반으로 어떻게 진행할 지 결정하고, 그 과정에서 결과를 표시하고, 계산이 완료되면 결과를 저장하기 위한 방법을 제공합니다.

### 💔 프로그래밍 언어의 구문과 의미

구문(syntax) : 문장이 구성되는 방식, 프로그램 작성 시 어떤 형태로 작성해야 하는 지 기술

의미(semantics) : 문장이 나타내는 의미, 프로그램 실행 시 어떤 일이 일어나는 지 기술

프로그래밍 언어에는 문법적으로 무엇이 맞고 무엇이 틀리는지 정의하는 규칙이 있는데 정확하게 표현해야 하며, 의미도 마찬가지로 해당 언어로 표현할 수 있는 모든 것에 대해 명확히 정의되어야 합니다.

이론상으로는 특정 프로그램이 구문상 정확한지, 의미가 무엇인지 모호함이 없어야 하지만, 프로그래밍 언어는 대개 단어로 정의되고, 자연 언어로 작성된 다른 문서와 마찬가지로 단어의 정의에는 모호성이 있어서 다르게 해석될 수 있습니다.

### 💦 참고

[자바스크립트 - 위키백과, 우리 모두의 백과사전](https://ko.wikipedia.org/wiki/%EC%9E%90%EB%B0%94%EC%8A%A4%ED%81%AC%EB%A6%BD%ED%8A%B8)

[http://web.donga.ac.kr/jwjo/Lectures/PL/chap4.pdf](http://web.donga.ac.kr/jwjo/Lectures/PL/chap4.pdf)

[프로그래밍 언어의 구문](https://hcr3066.tistory.com/122)

[[프로그래밍 언어론] 4. 구문론과 의미론](https://webstudynote.tistory.com/216)
