---
layout: single
title: "1일 1로그(63,64)"
categories: coding
tag: [python, jekyll, blog]
toc: true
author_profile: false
sidebar:
  nav: "docs"
# search: false
---

## 💥 인터넷이란?

전 세계의 컴퓨터를 연결하려면? 전체 네트워크가 매끄럽게 확장되도록 하려면 어떻게 해야 할까요?

위에 대한 해답은 인터넷입니다.

인터넷 : 느슨하고 체계가 없으며 혼란스럽고 임시적인 네트워크 모음으로, 네트워크와 그 위에 있는 컴퓨터가 서로 통신하는 방법을 규정하는 표준으로 묶여 있음, 전 세계를 하나로 연결하는 정보의 바다

![Untitled](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/c5800e61-c264-452a-a891-6dc4fb947fc3/Untitled.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Credential=AKIAT73L2G45EIPT3X45%2F20220820%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20220820T000043Z&X-Amz-Expires=86400&X-Amz-Signature=e361846ed6a09bb10e852c47b1ce70db33b2dd572f18d5c0a9ceb97319d87fab&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22Untitled.png%22&x-id=GetObject)

인터넷 역사 :

인터넷에 대한 아이디어는 1963년 라이 로봇고라는 사람의 아이디어를 굴림으로 개발되기 시작하였다. 1969년 미국 국방성 산하 고등연구계획국 ARPA (The Advanced Research Project Agency)는 일정지역의 폭탄폭격과 같은 긴급사태 시에도 장애를 받지 않고 정상적으로 제 기능을 발휘할 수 있는 통신망 구축 방법에 대한 연구를 추진하던 중 ARPA 연구원들 간의 정보와 자원 공유를 위하여 1969년부터 인터넷의 효시인 ARPANET(Advanced Research Projects Agency NETwork)란 컴퓨터 통신망을 구축하여 운용하기 시작하였다. ARPANET은 원격 시스템 접속, 파일 전송, 전자우편 및 정보공유가 가능한 컴퓨터통신망으로서 사용자 수의 증가와 망의 확장과 함께 미국의 중요한 컴퓨터 통신망으로 자리를 잡게 되었다. ARPANET의 확장과 함께 미국에서는 근거리통신망(LAN)기술과 워크스테이션의 보급에 따라 새로운 컴퓨터 통신망들이 탄생하여 발전하기 시작하였고, ARPANET은 이들 통신망들과의 상호 연결이 필요하게 되었다. 따라서 ARPA는 기종과 관계없이 통신망에 접속된 모든 컴퓨터간의 통신이 가능한 컴퓨터통신망 구축을 위해 새로운 통신 프로토콜과 통신망 구조가 필요하게 되었는데, 그것이 TCP/IP 프로토콜과 ARPA 인터넷 프로토콜이다. 1970년대 ARPANET은 한 달에 한 개꼴로 새로운 노드를 추가했고, 1972년에는 텔넷(Telnet) 프로토콜이, 1973년에는 파일 전송 프로토콜(FTP)이 발표되었으며, 1979년 말에는 유즈넷(Usenet)의 탄생과 함께 대망의 1980년대를 맞게 되었다. 1981년 8월 IBM PC가 선보였고 1982년에는 타임지가 컴퓨터를 올해의 인물로 선정했다.
이어서 1984년 애플(Apple)이 매킨토시(Macintosh)를 발표했으며 같은 해에 소설가 윌리엄 깁슨(William Gibson)이 공상과학소설에서 Cyberspace라는 말을 처음으로 사용했으며, 정보혁명, 제3의 물결과 같은 신조어들이 유행어처럼 번지기 시작하였다. 1980년대는 인터넷의 성장기로 대중 속에 파고들지는 못했어도 꾸준히 호스트 컴퓨터 수가 늘어났다. 네트워크가 TCP/IP라는 완성된 인터넷 프로토콜을 갖게 된 것은 1982년이었다. 1983년에는 인터넷 호스트 수를 측정하기 위 DNS(Domain Name System)가 처음 고안되었으며, 1984년 1월부터는 오늘날 널리 사용되고 있는 .gov, .mil, .edu, .org, .net, .com 등의 도메인이 등장했다. 인터넷 대중화가 급속하게 이루어진 것은 1990년대로 접어들면서 1991년 팀 버너스 리(Tim Berners-Lee)가 하이퍼텍스트(Hypertext)를 이용해 WWW를 제안했고 전자우편(E-Mail), FTP, 아키(Archie), 고퍼(Gopher), WAIS(Wide Area Information Server) 등
다양한 도구들이 실용화되거나 새로 등장하였다. 1992년에는 ISOC(The Internet Society, 인터넷 협회)가 설립되었고, 1992년에 NCSA 학생들이 WWW 방식의 인터넷 브라우저 모자이크(MOSAIC)를 만들었다. 그 중 한사람이었던 마크 앤드리슨이 1993년 넷스케이프(Netscape)브라우저를 개발하면서 인터넷 인구는 폭발적으로 증가하기 시작하였다. 이로써 TCP/IP는 인터넷의 표준 프로토콜로 자리를 잡게 되어 보다 많은 호스트와 게이트웨이들이 기존의 통신망에 아무런 영향을 주지 않고 인터넷에 연결할 수 있게 되었다. 이후 세계 각국의 학술 연구망들을 상호 연동하는 세계 최대 규모의 국제학술연구망으로 발전하였다. 특히 연구개발을 위한 UNIX시스템에서 TCP/IP를 기본적으로 제공하여 가장 저렴한 가격으로 신뢰성이 좋은 전산망을 쉽게 구축할 수 있다는 장점으로 인하여 인터넷은 미국의 대학, 연구소, 정부기관을 중심으로 확산되었으며 지금은 세계 최대 규모의 컴퓨터 통신망으로 발전하였다. 신뢰성 있는 정보 전달을 위한 통신망 구축에서 시작한 인터넷은 이제, 전 세계를 연결하는 지구촌 통신망으로 자리를 굳혔고 각국의 정보 고속도로 구축에 따라 더욱 더 통신망으로서의 역할이 커질 것이다. 통신망으로서의 인터넷의 성장을 굴림으로 인터넷에서 구할 수 있는 축적된 정보가 엄청나고 나날이 그 양이 증가하고 있기 때문에 최근에는 인터넷 사용자가 어떻게 자기가 원하는 정보를 쉽고 최적으로 찾을 수 있는가 하는 방법에 대한 연구가 활발하게 진행되고 있다. 또한, 인터넷 사용자 대부분이 정보를 검색하고 이용할 뿐만 아니라 정보의 창출자로서의 역할이 크기 때문에 쉽고 효율적으로 정보를 창출하기 위한 도구(Tool)들의 개발이 활발하게 진행되고 있다. 이와 같이, 인터넷의 성장과 발전에 따라 모든 사람이 인터넷을 사용하고 우리의 생활과 더욱더 밀접해 짐에 따라 이제는 기술적인 문제보다도, 인간의 입장에서 어떻게 하면 인터넷을 더욱 발전시키고 인간중심으로 이끌어 나갈 것인가에 대한 관심이 증대되고 있다. 특히 인터넷이 상업화되면서, 영리추구의 기업 생리가 기존의 인터넷이 추구한 '열린 통신', '열린 정보', '열린 마음'의 철학이 점차 퇴색돼 가고 있어 많은 우려의 목소리가 커지는 상황이다.

모든 네트워크에서, 특히 인터넷에서 오는 데이터를 어떤 형식으로 구성할지, 누가 먼저 말할 것이고 어떤 응답이 이어질 수 있는지, 오류를 어떻게 처리할지 등에 대한 합의는 프로토콜로 처리됩니다.

**프로토콜**은 일반적인 대화에서 이루어지는 약속과 어느 정도 비슷합니다. 즉, 상대방과 소통하기 위한 일련의 규칙입니다. 네트워크 프로토콜은 사회적 관습이 아닌 기술적 고려 사항에 바탕을 두며, 사회 조직에 적용되는 가장 엄격한 규칙보다도 훨씬 더 엄밀하게 정의됩니다. 그리고 많은 기득권 세력이 존재하기 때문에 프로토콜과 표준에 합의하는 일은 복잡합니다.

![Untitled](https://s3.us-west-2.amazonaws.com/secure.notion-static.com/0e7ebc3c-f379-4c00-a5fa-4ca8ca57bdb0/Untitled.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Credential=AKIAT73L2G45EIPT3X45%2F20220820%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20220820T000104Z&X-Amz-Expires=86400&X-Amz-Signature=5dd99a53ad253cc8c9d9fb2c87be35d732cc95de2d8933be7a53295ad9495ce4&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%22Untitled.png%22&x-id=GetObject)

### 인터넷 연결

게이트 웨이 : 이종 프로토콜 및 네트워크 간에 통신을 가능하게 하며 다른 네트워크로 들어가는 문 역할을 하는 네트워크 포인트 ex) 인터넷 유무선 공유기

[https://puzzle-puzzle.tistory.com/entry/네트워크-용어-게이트웨이-Gateway-게이트웨이와-라우터-차이점](https://puzzle-puzzle.tistory.com/entry/%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC-%EC%9A%A9%EC%96%B4-%EA%B2%8C%EC%9D%B4%ED%8A%B8%EC%9B%A8%EC%9D%B4-Gateway-%EA%B2%8C%EC%9D%B4%ED%8A%B8%EC%9B%A8%EC%9D%B4%EC%99%80-%EB%9D%BC%EC%9A%B0%ED%84%B0-%EC%B0%A8%EC%9D%B4%EC%A0%90)

라우터 : 패킷의 위치를 추출하여, 그 위치에 대한 최적의 경로를 지정하며, 이 경로를 따라 데이터 패킷을 다음 장치로 전향시키는 장치

[https://puzzle-puzzle.tistory.com/entry/네트워크-용어-라우터란-Router](https://puzzle-puzzle.tistory.com/entry/%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC-%EC%9A%A9%EC%96%B4-%EB%9D%BC%EC%9A%B0%ED%84%B0%EB%9E%80-Router)

패킷 : 정보 기술에서 패킷 방식의 컴퓨터 네트워크가 전달하는 데이터의 형식화된 블록 즉, 컴퓨터 네트워크에서 데이터를 주고받을 때 정해 놓은 규칙

패킷은 형식이 지정된 일련의 바이트입니다. 다양한 장치는 서로 다른 패킷 형식을 사용합니다.

패킷의 일부에는 패킷이 어디서 오고 어디로 향하는지를 알려 주는 주소 정보가 들어있습니다. 다른 부분에는 패킷의 길이 같으 패킷 자체에 대한 정보가 들어 있고, 마지막으로는 패킷이 전달하는 정보인 페이로드가 있습니다. 인터넷에서 데이터는 IP 패킷으로 전달되는데 큰 IP 패킷은 여러 개의 작은 이더넷 패킷으로 분할됩니다. 최대 크기의 이더넷 패킷이 최대 크기의 IP 패킷보다 훨씬 작기 때문입니다.

각 IP 패킷은 여러 개의 게이트웨이를 통과하는데 작동하기 위한 필요한 메커니즘은 무엇일까?

1. 주소

각 호스트 컴퓨터에는 전화번호처럼 인터넷상의 모든 호스트 중에서 자신을 고유하게 식별할 주소가 있어야 합니다. 식별 번호인 IP 주소는 32비트 또는 128비트이며, 짧은 주소는 인터넷 프로토콜 버전 4(IPv4)이고 긴 주소는 버전 6(IPv6)입니다.

[https://nordvpn.com/ko/blog/ipv4-ipv6-bigyo/](https://nordvpn.com/ko/blog/ipv4-ipv6-bigyo/)

2. 이름

사람들이 직접 접근하려고 시도하는 호스트는 사람이 사용하기에 적합한 이름을 가져야 합니다. 이름은 [www.nyu.edu](http://www.nyu.edu) 또는 ibm.com처럼 어디서나 찾아볼 수 있는 형식이며, 이를 도메인 네임이라고 합니다. 인터넷 인프라에서 필수적인 부분인 도메인 네임 시스템, 즉 DNS는 이름과 IP 주소 간 변환을 수행합니다.

3. 라우팅

각 패킷이 출발지에서 목적지까지의 경로를 찾는 메커니즘이 있어야 합니다. 게이트웨이는 어떤 개체가 어디에 연결되어 있는지 자기들끼리 라우팅 정보를 끊임없이 교환하고, 그 정보를 이용하여 각 수신 패킷을 최종 목적지에 더 가까운 게이트웨이 쪽으로 계속 전달합니다.

4. 프로토콜

정보가 한 컴퓨터에서 다른 컴퓨터로 성공적으로 복사되도록 이상의 구성 요소와 나머지 구성 요소 모두가 어떻게 상호 운용되는지 정확하고 자세하게 설명하는 규칙과 절차가 있어야 합니다. IP 패킷은 자체 프로토콜을 사용하는 다양한 종류의 네트워크 하드웨어에 의해 전달되고, IP 바로 위에서는 TCP라는 프로토콜이 IP를 사용하여 출발지에서 목적지까지 임의 길이의 바이트 시퀀스를 전송하기 위한 안정적인 메커니즘을 제공합니다. TCP 바로 위에서는 상위 레벨 프로토콜들이 TCP를 사용하여 웹 브라우징, 메일, 파일 공유등 우리가 ‘인터넷’이라고 생각하는 서비스를 제공합니다. IP 주소를 동적으로 변경하는 것은 DHCP 라는 프로토코에 의해 처리되는데 이 모든 프로토콜이 합쳐져서 인터넷을 규정합니다.

### 💔 참고

[1. ͳ](http://a24s.com/data/jeongbotongsinhakseub/jbgs/book/chp1/chp1-1.htm)

[[넷알못 사전] 프로토콜은 무엇인가요?](https://it.donga.com/31842/)

[패킷이란 무엇일까? 패킷의 정의와 구조(What is packet?)](https://enlqn1010.tistory.com/9)

[TCP/IP란 무엇이며 어떤 원리로 작동하나요?](https://nordvpn.com/ko/blog/tcp-ip-protocol/)
